@extends('layouts.about.layout')

@section('content')

    <div id="fh5co-about">
        <div class="container">
            <div class="about-content">
                <div class="row">
                    <div class="col-md-6" data-aos="fade-in" data-aos-duration="1000" data-aos-once="true">
                        <div class="desc">
                            <p>Добре дошли в "Джеронимо" – вашето надеждно място за висококачествени газови продукти. В основата на нашия бизнес е ангажиментът да внесем топлина, уют и удобство във всяко домакинство.</p>
                            <p>Нашият асортимент от газови продукти е проектиран, за да отговори на всички нужди на семейството, съчетавайки ефективност и безопасност.</p>
                        </div>
                        <div class="desc">
                            <p>В "Джеронимо" предлагаме широка гама от газови продукти, които са идеални за всеки дом. От уреди за отопление до газови печки, всеки продукт е избран с мисъл за максимална безопасност, надеждност и енергийна ефективност. Ние разбираме колко важно е да имате уреди, на които можете да разчитате.</p>
                            <p>Нашите продукти са специално създадени, за да подобрят живота на семействата. Предлагаме решения, които осигуряват постоянна топлина и уют в студените месеци и удобство през цялата година. С "Джеронимо" вашето семейство ще се радва на топлината и комфорта, които заслужава.</p>
                            <p>Избирайки "Джеронимо", вие се доверявате на магазин, който цени качеството и клиентското удовлетворение. Ние сме посветили време и усилия, за да гарантираме, че нашите продукти са най-добрите на пазара. Нашата отдаденост на безопасността и иновациите ни прави предпочитан избор за много семейства.</p>
                        </div>
                    </div>
                    <div class="col-md-6" data-aos="fade-in" data-aos-duration="1000" data-aos-once="true">
                        <img class="img-responsive" src="images/gas_carousel_home.webp" alt="about">
                    </div>
                </div>
            </div>
        </div>
    </div>

@endsection

