<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class CatBotController extends Controller
{
    public function respond(Request $request)
    {
        $userQuestion = $request->input('question');

        // Define questions and responses
        $questionsAndResponses = [
            'Разкажете ми повече за вас?' => 'В "Джеронимо" предлагаме широка гама от газови продукти, които са идеални за всеки дом. От уреди за отопление до газови печки, всеки продукт е избран с мисъл за максимална безопасност, надеждност и енергийна ефективност. Ние разбираме колко важно е да имате уреди, на които можете да разчитате.',
            'Това ли са всичките продукти, които предлагате?' => 'Моля, имайте предвид: Това не е пълният ни асортимент. Извиняваме се, но просто нямаме физическата възможност да вкараме всички наши продукти онлайн. За да разгледате всички наши продукти, заповядайте във физическия ни магазин на адрес <a href="https://www.google.com/maps/place/%D0%9A%D1%8A%D1%80%D1%88%D0%B8%D1%8F%D0%BA%D0%B0%D0%A1%D0%B5%D0%B2%D0%B5%D1%80%D0%B5%D0%BD,+%D1%83%D0%BB.+%E2%80%9E%D0%91%D1%80%D0%B5%D0%B7%D0%BE%D0%B2%D1%81%D0%BA%D0%B0%E2%80%9C+36,+4003+%D0%9F%D0%BB%D0%BE%D0%B2%D0%B4%D0%B8%D0%B2/@42.1595765,24.744671,17z/data=!3m1!4b1!4m6!3m5!1s0x14acd1916fbc589b:0xdab4a6ee45e50e2c!8m2!3d42.1595765!4d24.744671!16s%2Fg%2F11c23816cc?entry=ttu" target="_blank" style="text-decoration: none; color: #0275d8;">ул. „Брезовска“ 36, 4003 Пловдив</a>. Там ще откриете още много интересни предложения!',
            'Как можем да поръчаме?' => 'Може да поръчате чрез нашия сайт или да се свържете с нас на посочените контакти.',
            'Какви са начините на плащане?' => 'Плащането може да стане по банков път, чрез карта като се заплащата само продукта без доставка или наложен платеж.',
            'Какво е Stripe?' => 'Stripe е платформа за онлайн плащания, която позволява на компании да приемат плащания онлайн.',
            'Какви са начините на доставка?' => 'Доставката става с куриерска фирма.',
            'Какви са разходите за доставка?' => 'Разходите за доставка се определят от куриерската фирма и се заплащат от клиента.',
            'След колко време може да очаквам пратката си?' => 'Изпращаме вашите пратки във възможно най-ранни срокове.',
            'Как може да се свържем с вас?' => 'Може да се свържете с нас от контактната форма като ни изпратите имейл. Предоставили сме и контакти за връзка с нас.',
            'Какви гаранции предлагате за вашите продукти?' => 'Предлагаме стандартна гаранция за всички продукти, което осигурява пълна поддръжка и ремонт при производствени дефекти.',
            'Можете ли да ми препоръчате продукт според моите нужди?' => 'Разбира се! Свържете се с нас, и наш специалист ще Ви помогне да изберете най-подходящия продукт според вашите спецификации и нужди.',
            'Какви услуги още предлагате?' => 'Може да разгледате нашите други услуги на нашия уебсайт в раздел "Услуги".',
        ];

        $botResponse = $questionsAndResponses[$userQuestion] ?? 'Sorry, I do not understand that question.';

        return response()->json(['message' => $botResponse]);
    }

    public function getQuestions()
    {
        $questions = [
            'Разкажете ми повече за вас?',
            'Това ли са всичките продукти, които предлагате?',
            'Как можем да поръчаме?',
            'Какви са начините на плащане?',
            'Какво е Stripe?',
            'Какви са начините на доставка?',
            'Какви са разходите за доставка?',
            'След колко време може да очаквам пратката си?',
            'Как може да се свържем с вас?',
            'Какви гаранции предлагате за вашите продукти?',
            'Можете ли да ми препоръчате продукт според моите нужди?',
            'Какви услуги още предлагате?',
        ];

        return response()->json($questions);
    }
}
