<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class CatBotController extends Controller
{
    public function respond(Request $request)
    {
        $userQuestion = $request->input('question');

        // Define questions and responses
        $questionsAndResponses = [
            'Разкажете ми повече за вас?' => 'В "Джеронимо" предлагаме широка гама от газови продукти, които са идеални за всеки дом. От уреди за отопление до газови печки, всеки продукт е избран с мисъл за максимална безопасност, надеждност и енергийна ефективност. Ние разбираме колко важно е да имате уреди, на които можете да разчитате.',
            'Как можем да поръчаме?' => 'Може да поръчате чрез нашия сайт или да се свържете с нас на посочените контакти.',
            'Какви са начините на плащане?' => 'Плащането може да стане по банков път, чрез карта като се заплщата само продукта без доставка или наложен платеж.',
            'Какво е Stripe?' => 'Stripe е платформа за онлайн плащания, която позволява на компании да приемат плащания онлайн.',
            'Какви са начините на доставка?' => 'Доставката става с куриерска фирма.',
            'Какви са разходите за доставка?' => 'Разходите за доставка се определят от куриерската фирма и се заплащат от клиента.',
            'След колко време може да очаквам пратката си?' => 'Изпращаме вашите практи във възможно най-ранни срокове.',
            'Как може да се свържем с вас?' => 'Може да се свържете с нас от контактната форма като ни изпратите имейл. Предоставили сме и контакти за връзка с нас.',
            'Какви гаранции предлагате за вашите продукти?' => 'Предлагаме стандартна гаранция за всички продукти, което осигурява пълна поддръжка и ремонт при производствени дефекти.',
            'Можете ли да ми препоръчате продукт според моите нужди?' => 'Разбира се! Свържете се с нас, и наш специалист ще Ви помогне да изберете най-подходящия продукт според вашите спецификации и нужди.',
            'Какви услуги още предлагате?' => 'Може да разгледате нашите други услуги на нашия уебсайт в раздел "Услуги".',
        ];

        $botResponse = $questionsAndResponses[$userQuestion] ?? 'Sorry, I do not understand that question.';

        return response()->json(['message' => $botResponse]);
    }

    public function getQuestions()
{
    $questions = [
        'Разкажете ми повече за вас?',
        'Как можем да поръчаме?',
        'Какви са начините на плащане?',
        'Какво е Stripe?',
        'Какви са начините на доставка?',
        'Какви са разходите за доставка?',
        'След колко време може да очаквам пратката си?',
        'Как може да се свържем с вас?',
        'Какви гаранции предлагате за вашите продукти?',
        'Можете ли да ми препоръчате продукт според моите нужди?',
        'Какви услуги още предлагате?'
    ];

    return response()->json($questions);
}

}
