<section class="terms-section">
    <h2>Политика за бисквитки</h2>
    <p>Тази секция обяснява как и защо използваме бисквитки на нашия уебсайт.</p>

    <h3>1. Обща информация</h3>
    <p>Благодарим ви за посещението на нашия уебсайт. Този документ обяснява как използваме бисквитките, за да подобрим вашето потребителско изживяване.</p>

    <h3>2. Какво е бисквитка?</h3>
    <p>Бисквитката е малък текстов файл, който уебсайтът може да запази на вашето устройство, когато го посетите. Тя обикновено съдържа информация като предпочитанията ви за уебсайта или уникален идентификатор, който се използва за статистика и подобряване на вашето изживяване.</p>

    <h3>3. Защо използваме бисквитки?</h3>
    <p>Използваме бисквитки за:
        <ul>
            <li>Подобряване на работата на уебсайта.</li>
            <li>Анализ на трафика и поведението на потребителите.</li>
            <li>Идентифициране и проследяване на потребителските сесии.</li>
            <li>Персонализиране на съдържанието и рекламите, които виждате.</li>
        </ul>
    </p>

    <h3>4. Какви видове бисквитки използваме?</h3>
    <p>Използваме следните видове бисквитки:
        <ul>
            <li><strong>Задължителни бисквитки:</strong> Те са необходими за основните функции на сайта.</li>
            <li><strong>Функционални бисквитки:</strong> Помагат ни да запомним вашите предпочитания.</li>
            <li><strong>Аналитични бисквитки:</strong> Използват се за събиране на информация за вашето поведение на сайта и ни помагат да го подобрим.</li>
        </ul>
    </p>

    <h3>5. Управление на бисквитките</h3>
    <p>Вие имате контрол над бисквитките, които приемате. Можете да настроите вашия браузър да отхвърля всички или някои бисквитки или да ви изисква одобрение преди бисквитка да бъде запазена. Инструкции за управление на бисквитките може да намерите в помощната секция на вашия браузър.</p>

    <h3>6. Съгласие с политиката за бисквитки</h3>
    <p>Използвайки нашия уебсайт, вие се съгласявате с употребата на бисквитките според настоящата политика. Ако не сте съгласни, можете да настроите вашия браузър да ограничи бисквитките.</p>

    <h3>7. Промени в политиката за бисквитки</h3>
    <p>Можем периодично да променяме тази политика за бисквитки. Промените ще бъдат публикувани на този уебсайт. Препоръчваме ви регулярно да проверявате този документ за актуализации.</p>

    <h3>8. Контакт</h3>
    <p>Ако имате въпроси относно нашата политика за бисквитки, моля, свържете се с нас на jeronimostore1@gmail.com</p>
</section>
