<h3>Общи условия за ползване на онлайн магазин на ДЖЕРОНИМО Т ЕООД</h3>

    <section class="terms-section">
        <h2>1. Въведение</h2>
        <p>Добре дошли в нашия онлайн магазин. Следните условия регулират използването на услугите, предлагани на уебсайта , собственост на ДЖЕРОНИМО Т ЕООД, ЕИК 201806434, с адрес Северен, ул. „Брезовска“ 36, 4003 Пловдив.</p>
    </section>

    <section class="terms-section">
        <h2>2. Права и задължения на потребителя</h2>
        <p>Потребителите се задължават да използват уебсайта по начин, който не нарушава обществения ред, морала и приложимото законодателство. Всяка злоупотреба с ресурсите на уебсайта е строго забранена.</p>
    </section>

    <section class="terms-section">
        <h2>3. Предлагани продукти</h2>
        <p>Всички продукти, изложени в онлайн магазина, са с описание на техните основни характеристики и цена. ДЖЕРОНИМО Т ЕООД си запазва правото да променя цените без предизвестие, както и да коригира очевидни грешки в цените.</p>
    </section>

    <section class="terms-section">
        <h2>4. Поръчка и плащане</h2>
        <p>Поръчките се приемат посредством електронната платформа на уебсайта. Плащанията могат да се извършват чрез кредитна карта или други предварително одобрени методи на плащане.</p>
    </section>

    <section class="terms-section">
        <h2>5. Доставка</h2>
        <p>Доставката на продуктите се извършва до адреса, посочен от потребителя, в срокове, обявени на сайта. Таксите за доставка са за сметка на потребителя, освен ако не е указано друго.</p>
    </section>

    <section class="terms-section">
        <h2>6. Права за връщане и замяна</h2>
        <p>Потребителят има право да върне или замени продукта в рамките на 14 дни от датата на получаване, ако продуктът е в оригиналната си опаковка и не е използван.</p>
    </section>

    <section class="terms-section">
        <h2>7. Отговорност</h2>
        <p>ДЖЕРОНИМО Т ЕООД не носи отговорност за забавяне на доставката в случай на обстоятелства, които не зависят от компанията.</p>
    </section>

    <section class="terms-section">
        <h2>8. Изменение на условията</h2>
        <p>ДЖЕРОНИМО Т ЕООД може да променя тези общи условия по всяко време. Изменените условия влизат в сила незабавно след тяхното публикуване на уебсайта.</p>
    </section>

    <section class="terms-section">
        <h2>9. Контакти</h2>
        <p>За въпроси и контакти, моля обръщайте се към нас -  jeronimostore1@gmail.com</p>
    </section>
